(() => {
  const page0 = document.getElementById("page0");

  const view = document.createElement("div");

  view.innerHTML = `
<div class="content0">
<div class="logo">　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　<br>
　　　　　　　　　★　　　　　　　　　★　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　<br>
　　★　　★　　　★　　　　　　　　　★　　　　　　　　　　　　　　　　　　　　　　　　★　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　★★　　　　★　　　　　　　　　　　　　　　　　　　　★★　　　　　　　　　　　　　　　　　　　<br>
　　★　★★★★　★　　　　★★★★★★★★★★★　　　　★★★★★★★★　　　　　　　★　　　　　　　　　★　　　　　　　　　　　　★　　　　　　　　　　　　　★★　　　★　★　　　　　　　　　　　　　　　　　　　★　　　　　　　　　　★　　　　　　　　　<br>
　★　　　★　　　★★★　　　　★　　★　　　　　　　★★★　　　★　　　　　　　★★★★★★★　　　　　　★　　　　　★★　　　　　★　　　　　★★　　　　　　★★　　　　★　　　　　　　　　★　　　　　　　　★★★★★　　★★　　　　★　　　　　★★　　<br>
　　★★　★　★　★　★　　　　★　　★★★★★　　　　　　　　★　　　★　　　　　　★★　　　　　　　　　★　　　　　　★　　　　　★　　　　　　★　　　　　　★★　　　　　　　　　　　★★　　　　　　　　　　　★★　　　　　★★　　　★　　　　　　★　　<br>
　　★　★★　★★★　★　　　★★　　★　　　★　　　　　　　★　　　★　★　　　　　★　　　　　　　　　　★　　　　　　　★　　　　★　　　　　　　★　　　　　★★　　　　　　　　　　　　★★★★★★　　　　　　★　　　　★　　　　　　★　　　　　　　★　<br>
　★★　★★★★★★★　　　　★　　★★★★★★　　　　　　　★　　　　★　　　　★★★★★★　　　　　　　★　　　　　　　★　　　　★　　　　　　　★　　　　　★★　　　　　　　　　　★★★★　　　　★　　　　　★　　　　★　　　　　　★　　　　　　　★　<br>
　　★　★★★★　　★　　　★★★★　★　★★　　　　　　　　★　　　　　　　　　　　★　　　　★★　　　　★　　　　　　　★★　　　★　　　　　　　★★　　　　★★　　　　　　　　　　　　　★　　　★　　　　　★　　　　　★　　　　　　★　　　　　　　★★<br>
　　★　★★★★　　★　　　　★　　　　★★★　　　　　　　　★　　　　　　　　　　　★　　　　　★　　　　★★　　★　　　　　　　　★★　　★　　　　　　　　　★★　　　　★★　　　　　　　★　★　　　　　　★★　　★★★★　　　　　　★★　　★　　　　　<br>
　　★　★　　★　★★★　　　★　　　　★★　　　　　　　　　★★　　　　　　　　　　★　　　　　★　　　　　★　★　　　　　　　　　　★　★　　　　　　　　　　　★　　　★★　　　　　　　　★★　　　　　　　　　　　★　　★★★　　　　　★　★　　　　　　<br>
　　★　★　★★★★　★　　　★　　　★★　★★　　　　　　　　　★★★　　　　　　　★★　　　★　　　　　　　★★　　　　　　　　　　　★★　　　　　　　　　　　★★★★★　　　　　　　　　　★　　　　　　　　　　　★★★★　　　　　　　　★★　　　　　　<br>
　　　　　　　　　　　　　　　★　★★　　　　　★　　　　　　　　　　　　　　　　　　　★★★★　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　<br>
　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　<br></div>
  <textarea>
**更新履歴**
2025/02/21
ゲーム更新

2025/02/20
レスポンシブ対応

2025/02/18
ゲーム作成中
追々アプデ予定

2025/02/17
メインコンテンツ作成開始
ブログページ記載開始

2025/02/14
更新履歴実装
ブログページ実装

2025/02/13
HP本体の大枠作成
</textarea>
  <div class="text-container">
    <p>エンジニア歴1年目<br>
    休日は夜のほうが早くコードを書けるような気がして<br>
    気が付くと朝になっている<br>
    そんな感じの日記帳<br>
    現在javascriptを勉強中
    </p>
  </div>
</div>
  `;

  page0.appendChild(view);

})();
